Revit 2024 API
BuiltInFailures.AnalyticalModelFailures.AnalyticalCurvedPanelNotValid Property
 Analytical Curved Panel is not valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId AnalyticalCurvedPanelNotValid { get; }
Visual Basic
Public Shared ReadOnly Property AnalyticalCurvedPanelNotValid As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ AnalyticalCurvedPanelNotValid {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace